Repository: Odyno/simple-vertical-timeline
Catalog: languages/svt-*.po
Languages: it_it

source: Simple Vertical Timeline Preference
it_it: Simple Vertical Timeline preferenze

source: Settings
it_it: Impostazioni

source: Show extra social media sharing icons
it_it: Mostra il menù per lo share tramite social media

source: Show a little and invisible sign of this plugin ( Thanks! )
it_it: Mostra un piccolo e invisibile firma di questo plugin ( Grazie! )

source: Enable the tracking of this WordPress installation with anonymous data.
it_it: Abilita il recupero di dati anonimi su questa installazione di Wordpress

source: Simple Vertical Timeline is a simple plugin that allow you to create a timeline in your Blog or Page. You can decide to add it via shortcode or via useful and simple buttons in your editor. Follow me to discover this new feature for your WordPress. <h1>QUICK START, YOUR FIRST TIMELINE</h1> I explain how to do the timeline with a simple example, the timeline of plugin! First to all we need to open a new Article or Page. In your "Visual editor" you can discover 2 new buttons:
it_it: Simple Vertical Timeline è un plugin semplice che permette di inserire una timeline all’interno del tuo Blog/Pagina. Puoi decidere di creare la timeline tramite semplici tasti nel tuo editor oppure tramite shortcode. Seguimi e scopri questa funzionalità per il tuo Blog. <h1>La tua prima Timeline</h1>Ti spiegherò come fare una timeline tramite un semplice esempio, la timeline del plugin! Prima di tutto devi aprire una Pagina oppure un Articolo. Nel “Visual editor” scoprirai due nuovi bottoni:

source: <h2>STEP A</h2> The button "Simple Vertical Timeline" allow you to create the main vertical line were all of your events will be placed... so select one place on your article and click on this button: two new shortcode will be added in the palace selected. This is your first step! you have create the tempo line!
it_it: <h2>Primo Passo</h2> Il bottone "Simple Vertical Timeline" permette di creare una barra verticale dove verrano inserite tutti i successivi eventi… quindi seleziona uno spazio nel tuo articolo click su questo bottone. Due nuovi shortcode appariranno nel posto selezionato. Questo è il tuo primo passo! Hai appena creato la “tempo line”!

source: <h2>STEP B</h2> The button "Event for Simple Vertical Timeline" add a new event in the tempo line. It's very easy, move the pointer into the new element already created and click on it. One dialog will ask you to decide the title, just a quick starting note, the date and the color of node in the time line.
it_it: <h2>Secondo Passo</h2> Il bottone “Evento per Simple Vertical Timeline” aggiunge un nuovo evento all’interno del “tempo line”. E’ veramente semplice, muovi il cursore all’interno degli elementi appena creati ed infine click sul bottone. Un nuovo pannello comparirà e chiederà i dati principali per creare l’evento… dati come il titolo, qualche nota, la data ecc

source: The result is the same of previous button, one shortcode will be added on the place of mouse and the new event with all the information will be showed on the page
it_it: Il risultato è identico al bottone precedentemente selezionato, ma questa volta lo shortcode introduce un evento proprio nel punto in cui avevi posizionato il cursore

source: <h2>... IS IT ALL?</h2> Yes, if you don't want to customise the timeline, that's all. But if you want you can try to customise the event as you want. Now all the short code are on place and it's only up to you to add event or custom comment. Enjoy
it_it: <h2>… E’ tutto?</h2> Si… se non vuoi eseguire cose particolari o scherzi da geek, questo è tutto. Ma se vuoi puoi provare ad eseguire delle personalizzazioni, guardare come inserire un bottone, aggiungere uno stile diverso ecc ecc

source: Example
it_it: Esempio

source: What is probably present in your editor looks like this piece of code, here one time line with with 2 events: <pre class="codestyle">[svtimeline] [svt-event title="Decision time..." date="28/05/2016"] Lore ipsum... [/svt-event] [svt-event title="Decision time..." date="28/05/2016" class="svt-cd-yellow" button_link="https://.../" button_label=" more..." ] Lore ipsum... [/svt-event] [/svtimeline]</pre> Check the following sections to discover all the feature that you can use.
it_it: Ciò che probabilmente è presente nel vostro editor è qualcosa di simile a questo pezzo di codice… una timeline con 2 eventi: <pre class="codestyle">[svtimeline] [svt-event title="Decision time..." date="28/05/2016"] Lore ipsum... [/svt-event] [svt-event title="Decision time..." date="28/05/2016" class="svt-cd-yellow" button_link="https://.../" button_label=" more..." ] Lore ipsum... [/svt-event] [/svtimeline]</pre> Controllare le seguenti sezioni per scoprire tutte le funzionalità che è possibile utilizzare.

source: The <code>[svtimeline] ... [/svtimeline]</code> is the container of timeline
it_it: Il <code>[svtimeline] ... [/svtimeline]</code> è il contenitore della timeline

source: The <code>[svt-event ...] ... [/svt-event]</code> is used for the definition of one event and that need to be insert only within the <em>svtimeline</em> section.
it_it: Il <code>[svt-event ...] ... [/svt-event]</code> è usato per la definizione di un evento e deve essere inserito all’interno dello shortcode <em>svtimeline</em>.

source: Options
it_it: Opzioni

source: Description
it_it: Descrizione

source: The title of events
it_it: Il titolo degli eventi

source: The date of event
it_it: La data dell’evento

source: With this tag you can specify class for the icons or color of button
it_it: Con questo tag puoi specificare il css “class” per le icone, colori dei bottoni.

source: if specified with one href link then one button appears with this link.
it_it: Se specificato un “URI” verrà mostrato un pulsante con questo link.

source: if specified with one label then the label will be appear on the button.
it_it: Se specificata una etichetta verrà inserito un bottone con tale etichetta

source: Suggest a Feature
it_it: Suggerimenti

source: Report a Bug
it_it: Segnala un Bug

source: Rate the plugin on WordPress.org
it_it: Valuta il plugin su WordPress.org

source: Translator
it_it: Traduttori

source: I have %d apple
it_it: Ho %d mela
